Revit 2024 API
StoneApplicationType Enumeration
 The enumerated type representing the permitted values for the asset property "StoneApplication" from the "Stone" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum StoneApplicationType
Visual Basic
Public Enumeration StoneApplicationType
Visual C++
public enum class StoneApplicationType
Members
Member name | Description
Polished
Glossy
Matte
Unfinished
See Also
Autodesk.Revit.DB.Visual Namespace